{
  "class_name": "Sequential",
  "keras_version": "2.0.8",
  "config": [
    {
      "class_name": "Conv2D",
      "config": {
        "init": "glorot_uniform",
        "name": "conv2d_7",
        "input_dtype": "float32",
        "activation": "linear",
        "trainable": true,
        "nb_filter": 32,
        "border_mode": "valid",
        "subsample": [
          1,
          1
        ],
        "batch_input_shape": [
          null,
          150,
          150,
          3
        ],
        "nb_row": 3,
        "nb_col": 3

      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_11"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_7",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "border_mode": "valid",
        "strides": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "init": "glorot_uniform",
        "name": "conv2d_8",
        "input_dtype": "float32",
        "activation": "linear",
        "trainable": true,
        "border_mode": "valid",
        "subsample": [
          1,
          1
        ],
        "nb_filter": 32,
        "nb_row": 3,
        "nb_col": 3
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_12"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_8",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "border_mode": "valid",
        "strides": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "init": "glorot_uniform",
        "name": "conv2d_9",
        "activation": "linear",
        "trainable": true,
        "border_mode": "valid",
        "subsample": [
          1,
          1
        ],
        "nb_filter": 64,
        "nb_row": 3,
        "nb_col": 3
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_13"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_9",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "border_mode": "valid",
        "strides": [
          2,
          2
        ]
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "trainable": true,
        "name": "flatten_25"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "init": "glorot_uniform",
        "name": "dense_27",
        "trainable": true,
        "output_dim": 64
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_14"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "p": 0.5,
        "trainable": true,
        "name": "dropout_14"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "init": "glorot_uniform",
        "name": "dense_28",
        "trainable": true,
        "output_dim": 4
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "softmax",
        "trainable": true,
        "name": "activation_15"
      }
    }
  ],
  "backend": "tensorflow"
}